<!-- 可视化demo1 -->
<template>
  <div class="charts">
    <div id="demo1Chart1" :style="{width: '500px', height: '300px'}"></div>
    <div id="demo1Chart2" :style="{width: '500px', height: '300px'}"></div>
    <div id="demo1Chart3" :style="{width: '500px', height: '300px'}"></div>
    <div id="demo1Chart4" :style="{width: '500px', height: '300px'}"></div>
    <div id="aplayerDiv">
       <vue-scroll :ops="ops" class="vueScroll">
       <aplayer autoplay :float="false" :showLrc="true" :music="{
          title: '勋章',
          artist: '鹿晗',
          src: 'https://mp32.9ku.com/upload/128/2016/04/09/bs2ozagm0ti.mp3',
          pic: 'https://p2.music.126.net/ixIs5kkukgNYMmeDsc35_g==/29686813955450.jpg',
          lrc: '[ti:勋章][ar:鹿晗][al:勋章][by:][offset:0][00:00.37]勋章-鹿晗[00:02.12]词：朱婧汐Jing[00:03.87]曲：JamieScott,NicolasSquires,MichaelNeedle[00:06.43]和声：Victor刘伟德[00:08.68]制作人：JamieScott,NickSquires[00:11.00]歌词搜索www.90lrc.cn[00:27.33]故事开始在最初的那个梦中[00:32.44]满天星光只因我而闪烁[00:36.95]我看到平凡的我也会[00:40.21]有一刻不普通[00:48.96]前方是未知[00:49.60]迎面是海风[00:53.72]塞壬的歌会诱人忘记初衷[00:57.73]他们说每一个风浪[01:01.15]都能够淹没我[01:07.75]可我会像奥德休斯一样[01:12.99]朝着心中的方向[01:15.50]哪怕众神会在彼岸阻挡[01:18.75]当我需要独自站在[01:22.45]远方的沙场[01:26.40]武器就是我紧握的梦想[01:29.70]而我受过的伤[01:32.35]都是我的勋章[01:37.70]是谁说伟大才值得被歌颂[01:42.50]乘风破浪后也不会一定成功[01:47.25]生命只能向前[01:49.35]坚定信念的人都是英雄[01:57.25]可我会像奥德休斯一样[02:01.70]朝着心中的方向[02:04.40]哪怕众神会在彼岸阻挡[02:08.16]当我需要独自站在[02:12.41]远方的沙场[02:15.66]武器就是我紧握的梦想[02:19.31]而我受过的伤[02:21.81]都是我的勋章[02:26.63]武器就是我紧握的梦想[02:29.66]而我受过的伤[02:32.31]都是我的成长[02:36.11]我会像奥德休斯一样[02:40.76]朝着心中的方向[02:44.12]哪怕众神会在彼岸阻挡[02:47.37]当我需要独自站在[02:51.25]远方的沙场[02:54.37]武器就是我紧握的梦想[02:58.48]而我受过的伤[03:01.31]都是我的勋章[03:04.98]武器就是我紧握的梦想[03:08.83]而我受过的伤[03:11.44]都是我的成长[03:15.88]不管明天的路有多漫长[03:19.73]我再次启航[03:22.13]带着我的勋章[03:24.18]歌词编辑：EricFRQ',
        }" :list="musicList">
        </aplayer>
    </vue-scroll>
    </div>
  </div>
</template>


<script>
require("echarts-wordcloud");
require("echarts-liquidfill");
require('../../assets/data/china')  //引入china.js地图文件
import echartMapData from "../../assets/data/EchartMapData"//引入map数据
import aplayer from "vue-aplayer";
export default {
  data () {
    return {
      ops: {
          vuescroll: {},
          scrollPanel: {},
          rail: {
            keepShow:true
          },
          bar: {
            hoverStyle: true,
            onlyShowBarOnScroll: false, //是否只有滚动的时候才显示滚动条
            background: 'green',
            //opacity: 0.5,//滚动条透明度
            "overflow-x": "hidden"
          }
        },
      musicList: [{
           title: '勋章',
          artist: '鹿晗',
          src: 'https://mp32.9ku.com/upload/128/2016/04/09/bs2ozagm0ti.mp3',
          pic: 'https://p2.music.126.net/ixIs5kkukgNYMmeDsc35_g==/29686813955450.jpg',
          lrc: '[ti:勋章][ar:鹿晗][al:勋章][by:][offset:0][00:00.37]勋章-鹿晗[00:02.12]词：朱婧汐Jing[00:03.87]曲：JamieScott,NicolasSquires,MichaelNeedle[00:06.43]和声：Victor刘伟德[00:08.68]制作人：JamieScott,NickSquires[00:11.00]歌词搜索www.90lrc.cn[00:27.33]故事开始在最初的那个梦中[00:32.44]满天星光只因我而闪烁[00:36.95]我看到平凡的我也会[00:40.21]有一刻不普通[00:48.96]前方是未知[00:49.60]迎面是海风[00:53.72]塞壬的歌会诱人忘记初衷[00:57.73]他们说每一个风浪[01:01.15]都能够淹没我[01:07.75]可我会像奥德休斯一样[01:12.99]朝着心中的方向[01:15.50]哪怕众神会在彼岸阻挡[01:18.75]当我需要独自站在[01:22.45]远方的沙场[01:26.40]武器就是我紧握的梦想[01:29.70]而我受过的伤[01:32.35]都是我的勋章[01:37.70]是谁说伟大才值得被歌颂[01:42.50]乘风破浪后也不会一定成功[01:47.25]生命只能向前[01:49.35]坚定信念的人都是英雄[01:57.25]可我会像奥德休斯一样[02:01.70]朝着心中的方向[02:04.40]哪怕众神会在彼岸阻挡[02:08.16]当我需要独自站在[02:12.41]远方的沙场[02:15.66]武器就是我紧握的梦想[02:19.31]而我受过的伤[02:21.81]都是我的勋章[02:26.63]武器就是我紧握的梦想[02:29.66]而我受过的伤[02:32.31]都是我的成长[02:36.11]我会像奥德休斯一样[02:40.76]朝着心中的方向[02:44.12]哪怕众神会在彼岸阻挡[02:47.37]当我需要独自站在[02:51.25]远方的沙场[02:54.37]武器就是我紧握的梦想[02:58.48]而我受过的伤[03:01.31]都是我的勋章[03:04.98]武器就是我紧握的梦想[03:08.83]而我受过的伤[03:11.44]都是我的成长[03:15.88]不管明天的路有多漫长[03:19.73]我再次启航[03:22.13]带着我的勋章[03:24.18]歌词编辑：EricFRQ',
        },
         {
          title: '阿拉斯加海湾',
          artist:'女生版',
          src: "https://mp32.9ku.com/upload/128/2020/12/07/1012979.mp3",
          pic: 'https://p1.music.126.net/tczb_7II9KzSuLQsVt89Gw==/109951163049336667.jpg',
          lrc: '[ti:阿拉斯加海湾][ar:蓝心羽][al:阿拉斯加海湾][by:][offset:0][00:00.98]阿拉斯加海湾-蓝心羽[00:03.17]词：菲道尔/李康宁[00:04.55]曲：菲道尔[00:05.32]原唱：菲道尔[00:06.29]编曲：于山川@Cstudio[00:07.48]贝斯：石间@Cstudio[00:08.46]吉他：丁兆尊龙[00:09.61]和声编写：田跃君[00:11.00]和声：蓝心羽[00:12.29]混音：王巍MOKA[00:12.45]制作人：杜叔叔[00:12.65]统筹：文氓苏[00:13.76]宣发：张婧/寂瞳/游文雅/杜钰雯[00:15.17]OP：LoolalaMusicMSdn.Bhd.[00:15.52]SP：环球音乐版权管理集团(UniversalMusicPublishingCHINA)[00:17.19]音乐制作：极韵文化/BLUESTUDIO[00:18.35]音乐发行：极韵文化/BLUESTUDIO[00:19.75]出品：「极韵文化」/「BLUESTUDIO」/「造音行动」[00:20.61]（此版本为正式授权翻唱作品）[00:22.25]上天啊[00:25.29]难道你看不出我很爱她[00:29.41]怎么明明相爱的两个人[00:32.86]你要拆散他们啊[00:39.03]上天啊[00:41.93]你千万不要偷偷告诉她[00:46.24]在无数夜深人静的夜晚[00:49.85]有个人在想她[00:55.01]以后的日子你要好好照顾她[01:03.39]我不在她身旁你不能欺负她[01:11.51]别再让人走进她心里[01:15.98]最后却又离开她[01:20.84]因为我不愿再看她流泪啦[01:41.57]上天啊[01:44.55]你是不是在偷偷看笑话[01:48.65]明知我还没能力保护她[01:52.41]让我们相遇啊[01:58.45]上天啊[02:01.17]她最近是否不再失眠啦[02:05.41]愿世间温情化作一缕风[02:09.10]代替我拥抱她[02:14.37]以后的日子你要好好照顾她[02:22.59]我不在她身旁你不能欺负她[02:30.86]别再让人走进她心里[02:34.98]最后却又离开她[02:40.23]因为我不愿再看她流泪啦[02:47.80]希望我的努力能够赶上她[02:56.01]有天我能给她完整的一个家[03:04.41]可若你安排了别人给她[03:09.40]我会祝福她[03:13.24]上天你别管我先让她幸福吧[03:21.63]上天啊[03:24.70]这些晚上我对你说的话[03:28.92]你别不小心漏嘴告诉她[03:32.60]我怕会吵醒她[03:38.64]上天啊[03:41.73]你千万不要偷偷告诉她[03:45.88]在无数夜深人静的夜晚[03:49.55]我依旧在想她'
         },
          {
            title: '幻听',
            artist: '许嵩',
            src: "https://mp3.9ku.com/hot/2012/06-29/468406.mp3",
            pic: 'https://p2.music.126.net/mMZNB-jhYsw29K61QtopJA==/109951163187404137.jpg',
            lrc: '[ti:幻听][ar:许嵩][al:幻听][by:][offset:0][00:00.50]许嵩-幻听[00:02.50][00:03.50]作词：许嵩作曲：许嵩[00:06.50][00:10.50][00:17.50][00:35.38]在远方的时候[00:37.30]“又想你到泪流”[00:42.44]这矫情的措辞结构[00:46.07]经历过的人会懂[00:50.78]那些不堪言的疼痛[00:54.19]也就是我自作自受[00:59.30]你没有装聋[01:02.81]你真没感动[01:06.28][01:07.91]一个人的时候[01:10.70]偷偷看你的微博[01:15.29]你转播的歌好耳熟[01:18.41]我们坐一起听过[01:23.36]当日嫌它的唱法做作[01:27.18]现在听起来竟然很生动[01:32.22]可能是时光让耳朵变得宽容[01:38.01][01:40.21]如今一个人听歌总是会觉得失落[01:44.73]幻听你在我的耳边轻轻诉说[01:48.51]夜色多温柔[01:51.17]你有多爱我[01:56.29]如今一个人听歌总是会觉得难过[02:01.22]爱已不在这里我却还没走脱[02:04.90]列表里的歌[02:07.11]随过往流动[02:11.95][02:29.36]一个人的时候[02:32.34]偷偷看你的微博[02:36.26]你每天做了些什么[02:40.27]我都了然于胸[02:44.45]当时嫌你的蠢话太多[02:48.46]现在回想起画面已泛旧[02:53.02]可能是孤独让情绪变得脆弱[02:59.42][03:01.57]如今一个人听歌总是会觉得失落[03:05.91]幻听你在我的耳边轻轻诉说[03:09.68]夜色多温柔[03:11.82]你有多爱我[03:17.29]如今一个人听歌总是会觉得难过[03:22.38]爱已不在这里我却还没走脱[03:26.12]列表里的歌[03:28.30]随过往流动[03:32.70][03:34.02]如今一个人听歌总是会觉得失落[03:41.05]幻听你在我的耳边轻轻诉说[03:44.32]夜色多温柔[03:46.72]你有多爱我[03:52.08]如今一个人听歌总是会觉得难过[03:56.73]爱已不在这里我却还没走脱[04:00.86]如果你回头[04:03.09]不要放下我'
          },
          {
            title: '明天会更好',
            artist: '卓依婷',
            src: "https://mp3.9ku.com/mp3/39/38610.mp3",
            pic: 'https://p1.music.126.net/34YW1QtKxJ_3YnX9ZzKhzw==/2946691234868155.jpg',
            lrc: '[ti:明天会更好][ar:群星][al:明天会更好][by:][offset:0][00:00.68]明天会更好[00:01.59]演唱：群星[00:02.67][00:26.49]轻轻敲醒沉睡的心灵[00:29.68]慢慢张开你的眼睛[00:33.12]看看忙碌的世界[00:34.82]是否依然孤独的转个不停[00:39.88]春风不解风情[00:43.30]吹动少年的心[00:46.12]让昨日脸上的泪痕[00:49.20]随记忆风干了[00:54.04]抬头寻找天空的翅膀[00:57.17]候鸟出现它的影迹[01:00.44]带来远处的饥荒[01:02.21]无情的战火依然存在的消息[01:07.21]玉山白雪飘零[01:10.35]燃烧少年的心[01:13.44]使真情溶化成音符[01:16.37]倾诉遥远的祝福[01:20.13][01:21.55]唱出你的热情[01:23.17]伸出你的双手[01:24.79]让我拥抱着你的梦[01:27.91]让我拥有你真心的面孔[01:34.58]让我们的笑容[01:36.16]充满着青春的骄傲[01:40.80]为明天献出虔诚的祈祷[01:46.15][01:47.06]谁能不顾自己的家园[01:50.39]抛开记忆中的童年[01:53.31]谁能忍心看那昨日的忧愁[01:57.09]带走我们的笑容[02:00.48]青春不解红尘[02:03.47]胭脂沾染了灰[02:06.48]让久违不见的泪水[02:09.63]滋润了你的面容[02:14.86]唱出你的热情[02:16.40]伸出你的双手[02:18.05]让我拥抱着你的梦[02:21.22]让我拥有你真心的面孔[02:27.77]让我们的笑容[02:29.23]充满着青春的骄傲[02:34.02]为明天献出虔诚的祈祷[02:41.22][02:43.73]轻轻敲醒沉睡的心灵[02:46.72]慢慢张开你的眼睛[02:50.08]看看忙碌的世界[02:51.93]是否依然孤独的转个不停[02:57.03]日出唤醒清晨[03:00.04]大地光彩重生[03:03.00]让和风拂出的音响[03:06.14]谱成生命的乐章[03:09.85][03:11.41]唱出你的热情[03:12.83]伸出你的双手[03:14.43]让我拥抱着你的梦[03:17.64]让我拥有你真心的面孔[03:24.12]让我们的笑容[03:25.70]充满着青春的骄傲[03:30.36]让我们期待着明天会更好[03:37.12]唱出你的热情[03:38.57]伸出你的双手[03:40.24]让我拥抱着你的梦[03:43.47]让我拥有你真心的面孔[03:50.04]让我们的笑容[03:51.54]充满着青春的骄傲[03:56.16]让我们期待着明天会更好[04:02.97]唱出你的热情[04:04.59]伸出你的双手[04:06.16]让我拥抱着你的梦[04:09.42]让我拥有你真心的面孔[04:16.07]让我们的笑容[04:17.36]充满着青春的骄傲[04:21.80]让我们期待着明天会更好[04:28.07][04:28.82]唱出你的热情[04:30.23]伸出你的双手[04:31.84]让我拥抱着你的梦[04:35.18]让我拥有你真心的面孔[04:41.69]让我们的笑容[04:43.12]充满着青春的骄傲[04:47.94]让我们期待着明天会更好[04:54.04][04:54.68]唱出你的热情[04:55.98]伸出你的双手[04:57.65]让我拥抱着你的梦[05:01.02]让我拥有你真心的面孔'
          }]
    };
  },
  components: {
    aplayer: aplayer
  },
  computed: {},
  mounted() {
    this.drowWorldCloud()
    window.addEventListener('resize', () => {
      this.chart.resize();
    });
  },
  created() {},
  methods: {
    drowWorldCloud(){
      let myChart1 = this.$echarts.init(document.getElementById('demo1Chart1'))
      let myChart2 = this.$echarts.init(document.getElementById('demo1Chart2'))
      let myChart3 = this.$echarts.init(document.getElementById('demo1Chart3'))
      let myChart4 = this.$echarts.init(document.getElementById('demo1Chart4'))
      myChart1.setOption({
        backgroundColor:'#fff',
            tooltip: {
              pointFormat: "{series.name}: <b>{point.percentage:.1f}%</b>"
            },
            series: [
              {
                type: "wordCloud",
                gridSize: 2,
                shape: "circle",
                // shape: 'pentagon',
                sizeRange: [12, 50],
                // rotationRange: [-90, 90],
                // width: 600,
                // height: 300,
                left: "center",
                top: "center",
                width: "70%",
                height: "80%",
                right: null,
                bottom: null,
                drawOutOfBound: false,
                textStyle: {
                  normal: {
                    fontFamily: "sans-serif",
                    fontWeight: "bold",
                    color: function() {
                      return (
                        "rgb(" +
                        [
                          Math.round(Math.random() * 160),
                          Math.round(Math.random() * 160),
                          Math.round(Math.random() * 160)
                        ].join(",") +
                        ")"
                      );
                    }
                  },
                  emphasis: {
                    shadowBlur: 10,
                    shadowColor: "#333"
                  }
                },
                data: [{name:"活着", value:2352}, {name:"追风筝的人", value:123}]
              }
            ]
      });
      myChart2.setOption({
        series: [{
        type: 'liquidFill',
        data: [0.6]
       }]
      });

      myChart3.setOption(echartMapData),
        window.addEventListener('resize', () => {
          // 自动渲染echarts
          myChart3.resize();
        })
      myChart4.setOption({
        title: {
        text: '某站点用户访问来源',
        subtext: '纯属虚构',
        left: 'center'
      },
      tooltip: {
          trigger: 'item',
          formatter: '{a} <br/>{b} : {c} ({d}%)'
      },
      legend: {
          orient: 'vertical',
          left: 'left',
          data: ['直接访问', '邮件营销', '联盟广告', '视频广告', '搜索引擎']
      },
      series: [
          {
              name: '访问来源',
              type: 'pie',
              radius: '55%',
              center: ['50%', '60%'],
              data: [
                  {value: 335, name: '直接访问'},
                  {value: 310, name: '邮件营销'},
                  {value: 234, name: '联盟广告'},
                  {value: 135, name: '视频广告'},
                  {value: 1548, name: '搜索引擎'}
              ],
              emphasis: {
                  itemStyle: {
                      shadowBlur: 10,
                      shadowOffsetX: 0,
                      shadowColor: 'rgba(0, 0, 0, 0.5)'
                  }
              }
          }
      ]
      });
    }
  }
}
</script>
<style scoped>
  .charts{
      width: 1010px;
      height: 650px;
      display: flex;
      flex: 1;
      flex-wrap: wrap;
    }
  #demo1Chart1{
    border: solid 1px #eea7ba;
  }
  #demo1Chart2{
    border: solid 1px #eea7ba;
  }
  #demo1Chart3{
    border: solid 1px #eea7ba;

  }
  #demo1Chart4{
    border: solid 1px #eea7ba;

  }
  #aplayerDiv{
    border: solid 1px #eea7ba;
    height: 600px;
    width: 330px;
    position: relative;
    left: 1005px;
    top: -605px;
  }
  #aplayerDiv .vueScroll{
    height: 600px !important;
  }
</style>
<style>
  .aplayer-lrc{
     height: 110px !important;
     position: relative;
     top: -25px;
   }
  .aplayer-info{
    height: 200px !important;
  }
</style>